---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternColor
source: html/af4ab993-023c-c02d-9882-3e7c7ba335ae.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternColor Property

The override color of the surface background pattern.

## Syntax (C#)
```csharp
public Color SurfaceBackgroundPatternColor { get; }
```